# 1. Создайте столбец, состоящий из 300 строк. В каждой строке укажите числа от 1 до 300 по возрастанию с шагом 1.
# 2. Создайте другой столбец, состоящий из 300 строк. В каждой строке укажите числа от 101 до 400 по возрастанию с шагом 1.
# 3. Перемножьте между собой значения этих столбов построчно. Запишите результат умножения в третий столбец. То есть в первой строке третьего столбца будет 101 (=1*101), в 300-й - 120000 (=300*400).
# 4. Добавьте к концу каждой строки третьего столбца символы “qwerty”.

import pandas as pd
import numpy as np
df = pd.DataFrame(columns=["column1", "column2", "column3"])
df['column1'] = np.arange(1, 301)
df['column2'] = np.arange(101, 401)
df['column3'] = df['column1'] * df['column2']
df['column3'] = df['column3'].astype(str) + 'qwerty'
print(df)
